In [2]:
import pandas as pd
import numpy as np
from tabula import read_pdf
import tabula

In [ ]:
box = [2.82,0.44,7.3,6.19]
box2 = [4.58]

In [ ]:
box = [2.82,0.44,7.3,6.19]
fc = 28.28
         
for i in range(0, len(box)):
    box[i] *= fc

In [ ]:
df = read_pdf('')

In [ ]:
df = read_pdf("97.pdf", pages=[1])

In [ ]:
pd.

In [ ]:
df = pd.read_json(df)

In [ ]:
import glob

In [ ]:
tabula.convert_into_by_batch("data", output_format='csv', pages='all')

In [ ]:
import dask.dataframe as dd
ddf = dd.read_csv(f"{'data'}/*.csv")

In [ ]:
ddf.compute(error_bad_lines=False)

In [ ]:
ddf.shape

In [ ]:
dd.DataFrame.to_csv(ddf, filename='copper_95-22')

In [ ]:
ddf.head(100)

In [7]:
df = pd.read_csv('historic_prices.csv')

In [ ]:
df

In [14]:
prices = pd.read_csv('historic_prices.csv')

In [18]:
prices

             date   value
0      1959-07-02  0.2930
1      1959-07-06  0.2910
2      1959-07-07  0.2820
3      1959-07-08  0.2846
4      1959-07-09  0.2760
...           ...     ...
15845  2022-10-02     NaN
15846  2022-10-03     NaN
15847  2022-10-04     NaN
15848  2022-10-05     NaN
15849  2022-10-06     NaN

[15850 rows x 2 columns]

In [12]:
df2 = pd.read_csv('total_vehicle_sales.csv')

In [13]:
df2

           DATE  TOTALSA
0    1976-01-01   12.814
1    1976-02-01   13.340
2    1976-03-01   13.378
3    1976-04-01   13.223
4    1976-05-01   12.962
..          ...      ...
555  2022-04-01   14.956
556  2022-05-01   13.258
557  2022-06-01   13.491
558  2022-07-01   13.801
559  2022-08-01   13.623

[560 rows x 2 columns]

In [16]:
df2 = pd.read_csv('auto_production.csv')

In [17]:
df.head(200)

           date   value
0    1959-07-02  0.2930
1    1959-07-06  0.2910
2    1959-07-07  0.2820
3    1959-07-08  0.2846
4    1959-07-09  0.2760
..          ...     ...
195  1960-04-12  0.2999
196  1960-04-13  0.3017
197  1960-04-14  0.2994
198  1960-04-18  0.2991
199  1960-04-19  0.2987

[200 rows x 2 columns]

## Prices

In [21]:
from prophet import Prophet

In [20]:
prices

             date   value
0      1959-07-02  0.2930
1      1959-07-06  0.2910
2      1959-07-07  0.2820
3      1959-07-08  0.2846
4      1959-07-09  0.2760
...           ...     ...
15845  2022-10-02     NaN
15846  2022-10-03     NaN
15847  2022-10-04     NaN
15848  2022-10-05     NaN
15849  2022-10-06     NaN

[15850 rows x 2 columns]

In [23]:
prices.isnull().value_counts()

date    value
False  False     15829
       True         21
dtype: int64

In [24]:
prices = prices.dropna()

In [29]:
prices = prices.rename(columns={'date':'ds', 'value':'y'})

In [31]:
prices = prices.rename(columns={'value':'y'})

In [27]:
m = Prophet()
m.fit(prices)

ValueError: Dataframe must have columns "ds" and "y" with the dates and values respectively.

In [30]:
prices

               ds   value
0      1959-07-02  0.2930
1      1959-07-06  0.2910
2      1959-07-07  0.2820
3      1959-07-08  0.2846
4      1959-07-09  0.2760
...           ...     ...
15824  2022-09-09  3.5520
15825  2022-09-12  3.6176
15826  2022-09-13  3.5328
15827  2022-09-14  3.5168
15828  2022-09-15  3.5072

[15829 rows x 2 columns]